# Пример 1:
s = 'a3573'
print(s[1].isdigit())   # 3 - True


k = 'a3573'
print(k[0].isdigit())    # a - False


# Пример 2:
matrix = [
    [1, 2, 3, 4, 5, 6],
    [2, 21, 31, 41, 5, 6],
    [3, 22, 32, 42, 5, 6],
    [4, 23, 33, 43, 5, 6],
    [5, 24, 34, 44, 5, 6],
    [6, 25, 35, 45, 5, 6]
]
print(matrix)
for i in matrix:
    print(i)
# print(matrix)


# Пример 3:
matrix = [
    [1, 2, 3, 4, 5, 6],
    [2, 21, 31, 41, 5, 6],
    [3, 22, 32, 42, 5, 6],
    [4, 23, 33, 43, 5, 6],
    [5, 24, 34, 44, 5, 6],
    [6, 25, 35, 45, 5, 6]
]
matr = []
for i in range(1, 7):
    temp = []
    for j in range(1, 7):
        temp.append(i*j)
    matr.append(temp)
for i in matr:
    print(''.join(f'{n:<4}' for n in i))  # убрали [], выровняли цифры в ряд, 
                                          # увеличить расстояние между рядами 4
# 1   2   3   4   5   6   
# 2   4   6   8   10  12  
# 3   6   9   12  15  18  
# 4   8   12  16  20  24  
# 5   10  15  20  25  30  
# 6   12  18  24  30  36 

# если поменять знак на '>', то расстояние добавится перед рядами
#   print('A'.join(f'{n:>4}' for n in i)) 
#    1   2   3   4   5   6
#    2   4   6   8  10  12
#    3   6   9  12  15  18
#    4   8  12  16  20  24
#    5  10  15  20  25  30
#    6  12  18  24  30  36

#   print('A'.join(f'{n:04}' for n in i)), поменять на 0   
# 1   A2   A3   A4   A5   A6   
# 2   A4   A6   A8   A10  A12  
# 3   A6   A9   A12  A15  A18  
# 4   A8   A12  A16  A20  A24  
# 5   A10  A15  A20  A25  A30  
# 6   A12  A18  A24  A30  A36  

#   print('A'.join(f'{n:04}' for n in i)), заполнит пробелы 0
# 000100020003000400050006
# 000200040006000800100012
# 000300060009001200150018
# 000400080012001600200024
# 000500100015002000250030
# 000600120018002400300036
